Revit 2027 API
FilledRegionType.BackgroundPatternColor Property
 The background fill pattern color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color BackgroundPatternColor { get; set; }
Public Property BackgroundPatternColor As Color
	Get
	Set
public:
property Color^ BackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member BackgroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace